import pandas as pd
import pytest


@pytest.fixture
def sample_transactions():
    """Фикстура с тестовыми транзакциями"""
    return pd.DataFrame(
        {
            "Дата операции": ["01.12.2021 14:40:00", "15.12.2021 14:30:00", "31.12.2021 20:00:00"],
            "Номер карты": ["*7197", "*4556", "*7197"],
            "Сумма операции": [-1000.0, -500.0, -2000.0],
            "Кэшбэк": [10.0, 5.0, 20.0],
            "Категория": ["Супермаркеты", "Рестораны", "Электроника"],
            "Описание": ["Пятерочка", "Макдональдс", "М.Видео"],
        }
    )


@pytest.fixture
def sample_date():
    """Фикстура с тестовой датой"""
    return "2021-12-20 14:30:00"
